

function task000644()
   装备物品("青铜短剑")
   装备物品("折扇")
   装备物品("布衣")
   装备物品("布裙")
   装备物品("双短剑")
   装备物品("牛皮鞭")
   装备物品("曲柳仗")
   装备物品("黄铜圈")
   装备物品("细木棒")
   装备物品("铁爪")
end


function 通用_主线()
	调试信息("没有从LUA中匹配到任务, 使用默认的任务处理")
   	点击任务()
	等待停止奔跑()
   	对话()

	if 存在图片("对话框/新手主线") then
		点击对话框内图片("新手主线")
	end

	if 存在图片("对话框/对话框-战斗") then
		点击对话框内图片("对话框-战斗")
	end

	if 存在图片("对话框/王夫人任务") then
		点击对话框内图片("王夫人任务")
	end


	if 存在图片("战斗") then
		延迟(2)
		关闭无关窗口()
		点击图片("战斗", -60, 60)  --靠近
		等待停止奔跑()
		变动点击("战斗", 0, 60)
		if 存在图片("新手主线") then
			点击对话框内图片("新手主线")
		end

		点击对话框内图片("算了不打扰了", 0, -25)
	end

	--本来做 找 超级巫医 的任务
	--if 存在图片("任务NPC标识") then
	--	点击图片("任务NPC标识", 0, 60)
	--	点击对话框内图片("新手主线")
	--	点击对话框内图片("玄大夫治病")
	--end

end


function task000700()
	点击任务()
	等待停止奔跑()
	变动点击("战斗", 0, 50)
	点击对话框内图片("对话框-战斗")
end

function task000701()
   加血()
end

function task000702()
   使用辅助技能("烹饪")
end


function task000703()
	点击任务()
	等待停止奔跑()
	对话()
    点击对话框内图片("对话框-战斗")
end

function task000705()
   玩家宠物("参战")
end

function 玄大夫()
   点击任务()
   等待停止奔跑()
   对话()
   点击对话框内图片("玄大夫治病")
end


function 地图找平儿()
   点击小地图("去找萍儿")
   对话()
end

function 这就上船()
   点击任务()
	等待停止奔跑()
   对话()
   点击对话框内图片("这就上船啦")
end

function task000640()
   点击任务()
   等待停止奔跑()
   对话()
	点击对话框内图片("我知道了")
end

function task000642()
   点击任务()
   等待停止奔跑()
   对话()
   点击对话框内图片("新手主线")
   点击对话框内图片("task000432")
   延迟(2)
   点击图片("task000437", 9)    --程度到9, 不然容易点到菩提祖师...
end

function task000438()
	点击任务()
	等待隐藏提示消失()
	对话(30, -10)
	点击对话框内图片("新手主线")
	点击对话框内图片("task000440")
	点击对话框内图片("task000441")
end


function task000442()
	点击任务()
	对话()
	点击对话框内图片("新手主线")
	点击对话框内图片("学习技能")

	次数 = 0
	while 次数 < 10 do
		点击图片("学习按钮")
		点击坐标(640/2, 480/2)
		次数 = 次数 + 1
	end

end

function 学习蛛丝阵法任务()
	点击任务()
	对话(30, -60)
	点击对话框内图片("新手主线")
	点击对话框内图片("学习技能")
	点击图片("蛛丝阵法技能")

	次数 = 0
	while 次数 < 5 do
		点击图片("学习按钮")
		点击坐标(640/2, 480 - 100)	--移动鼠标到别的地方, 不然下次点击无效(游戏反外挂)
		次数 = 次数 + 1
	end
end

function 学习移形幻影任务()
	点击任务()
	对话(30, -60)
	点击对话框内图片("新手主线")
	点击对话框内图片("学习技能")
	点击图片("移形幻影技能")
	
	次数 = 0
	while 次数 < 5 do
		点击图片("学习按钮")
		点击坐标(640/2, 480 - 100)	--移动鼠标到别的地方, 不然下次点击无效(游戏反外挂)
		次数 = 次数 + 1
	end
end

function task000448()
	按键("ALT+W")
	点击图片("task000449")
	点击图片("task000450")
	点击图片("task000451")
end

function task000452()
	点击任务()
	对话()
	点击对话框内图片("task000454")
end



function task000455()
	按键("ALT+E")
	右击("task000456")
end


function 用飞行符前往建业城()
	装备物品("飞行符")
	点击图片("传送_建业", 30, 0)
end

function task000461()
	点击任务()
	等待停止奔跑()
	对话(20, -30)
	点击对话框内图片("新手主线")
end



function task000463()
	点击任务()
	等待停止奔跑()
	对话(60, -60)
	点击对话框内图片("新手主线")
end

function task000465()
	点击任务()
	等待停止奔跑()
	对话(-20, -20)
	点击对话框内图片("新手主线")
end

function task000467()
	点击任务(1)
	等待停止奔跑()
	对话(60, -60)
	点击图片("确定给予")
end

function task000469()
	点击任务()
	等待停止奔跑()
	x = 640/2
	y = 480/2

	移动鼠标到(x + 15, y - 70)
	按键("ALT+G")
	点击(0, 10)
	移动鼠标到(100, 100)
	if 存在图片("向NPC给予专用界面") then
		右击("物品\\红烧鱼")
		变动点击("确定给予")
	end
end

function task000475()
	点击任务(1)
	对话()
	点击对话框内图片("新手主线")
	延迟(2)
	if 存在图片("向NPC给予专用界面") then
		变动点击("确定给予")
	end
end


function task000477()
	点击任务()
	等待停止奔跑()
	对话(-100, 29)
	点击对话框内图片("新手主线")
	
end


function task000706()

	if 当前城市("沉船内室") then
		点击任务()
		等待停止奔跑()
		对话()
		点击对话框内图片("新手主线")
		点击对话框内图片("对话框-战斗")
	else
		点击任务()
		等待停止奔跑()
		点击坐标(420, 300)

		走到旁边("task000482")
		对话()
	end

end

function task000479()

	if 当前城市("沉船内室") then
		点击任务()
		等待停止奔跑()
		对话()
		点击对话框内图片("新手主线")
		点击对话框内图片("对话框-战斗")
	elseif 当前城市("东海湾") then
		点击任务()
		等待停止奔跑()
		对话()
	else
		点击任务()
		等待停止奔跑()
		点击坐标(420, 300)

		走到旁边("task000482")
		对话()
	end

end


function task000483()
	点击任务()
	等待停止奔跑()
	变动点击("战斗", 0, 50)
	点击对话框内图片("新手主线")
	点击对话框内图片("对话框-战斗")
end


function task000485()
	点击任务()
end

function task000486()
	点击任务()
	等待停止奔跑()
	对话(-20, -20)
	点击对话框内图片("新手主线")
	点击对话框内图片("task000488")
end

function task000712()
	按键("ALT+W")
	点击图片("task000449")
	点击图片("task000450")
	点击图片("task000451")	
end


function task000711()
	if 当前城市("建邺民居内室") then
		点击任务()
		等待停止奔跑()
		对话(-100, 29)
		点击对话框内图片("新手主线")
	else
		点击任务()
		等待停止奔跑()
	end
end

function task000722()
	if 当前城市("盘丝岭") then
		点击任务(3)
		等待停止奔跑()
	elseif 当前城市("盘丝洞") then
		点击任务(2)
		等待停止奔跑()
		对话()
		点击对话框内图片("新手主线")
	else
		按键("F8")  --天蚕丝
	end

end

function task000723()

	if 当前城市("长安城") then
		点击任务()
		等待停止奔跑()
		对话(0, -60)
		点击对话框内图片("新手主线")
	else
		装备物品("红色合成旗")
		延迟(2)
		点击图片("红色合成旗-歌", -40, 40)
	end
end

function task000496()
	点击任务()
	等待停止奔跑()
	对话(-10, -30)
	点击对话框内图片("新手主线")	
end

function task000724()
	点击任务()
	等待停止奔跑()
	对话(60, -60)
	点击对话框内图片("新手主线")
end

function task000725()
	点击任务()
	等待停止奔跑()
	对话(10, -30)
	点击对话框内图片("新手主线")
	点击对话框内图片("对话框-战斗")
end

--王夫人任务开始..这里停掉, 去做日常
function task000726()
	领取日常任务("除暴安良")
end

--大唐国飞贼  除暴安良日常
function task000728()
	if(当前城市("长安城")) then
		点击小地图("小地图-大唐国境", -70, 10)
		点击坐标(60, 420)
	end
end

--化生寺飞贼  除暴安良日常
function task000733()
	if(当前城市("长安城")) then
		点击小地图("小地图-化生寺", -20, -30)
		点击坐标(510, 94)  --传送门
	end
end
--师门任务
--function 方巾()
--	--使用飞行符号
--	--传送到长安
--	--走到 布 店
--	--点击老板
--	--购买方巾
--end


--脚本加载标志
已经加载战斗脚本 = false

--开始
function 脚本入口()

    local 匹配到任务 = true

	if 已经加载战斗脚本 == false then
		调试信息("加载战斗脚本")
		dofile("任务-战斗.lua")
		已经加载战斗脚本 = true
	end

	检测离线()
	关闭无关窗口()
	
	if 当前城市("轮回司") then
		点击图片("轮回司标识", -70, 0)
		变动点击("轮回司标识", -150, 20)
		点击对话框内图片("好啊")
	end

	状态 = 获取玩家状态()
	if 状态 == 战斗状态 then
		if 存在图片("战斗-菜单2") then
			战斗回调()
		elseif 存在图片("宠物战斗菜单") then
			宠物战斗回调()
		end
	elseif 状态 == 正常状态 then
		匹配到任务 = 匹配任务()
	elseif 状态 == 动画状态 then
		点击图片("跳过动画")
	else
		调试信息("未知状态..")
	end

	if (匹配到任务 == false) then
		通用_主线()
	end

end