
function task000790()
   装备物品("青铜短剑")
   装备物品("折扇")
   装备物品("布衣")
   装备物品("布裙")
   装备物品("双短剑")
   装备物品("牛皮鞭")
   装备物品("曲柳仗")
   装备物品("黄铜圈")
   装备物品("细木棒")
   装备物品("铁爪")
end

function task000644()
   装备物品("青铜短剑")
   装备物品("折扇")
   装备物品("布衣")
   装备物品("布裙")
   装备物品("双短剑")
   装备物品("牛皮鞭")
   装备物品("曲柳仗")
   装备物品("黄铜圈")
   装备物品("细木棒")
   装备物品("铁爪")
end

--新手加血任务
function task000882()
	加血()
end

脚本_战斗结束 = false   --用来判断吃药!
脚本_靠近左面 = false

--没有匹配到任务的时候, 但是有可点击的下划线时调用这个函数
function 通用_主线()
	调试信息("默认的任务处理")
	
	等待标识消失()
	关闭无关窗口()
    点击下划线()



	if 存在图片("战斗", 0.5) then
		调试信息("通用任务处理中检测到战斗标志")
		x, y = 获得图片位置("战斗", 0.5)
		if x < 200 then
			移动鼠标到(x, y)
			确保接触到NPC()
			按键("ALT+A")
			点击()
		else
			--靠近到右面
			if 脚本_靠近左面 then
				点击图片("战斗", 50, 50)  --靠近
				脚本_靠近左面 = false
			else
				点击图片("战斗", -50, 50)  --靠近
				脚本_靠近左面 = true
			end

			等待停止奔跑()

			按键("F9")
			按键("ALT+H")

			x, y = 获得图片位置("战斗", 0.5)

			移动鼠标到(x, y+50)
			确保接触到NPC()
			点击()  --对话
			等待对话框出现()
		end

	
		if 存在图片("对话框/新手主线") then
			点击对话框("新手主线")
			点击对话框("对话框-战斗")
		end

		if 存在图片("对话框/对话框-战斗") then
			点击对话框("对话框-战斗")
		end

		return
	end

   	对话()

	if 存在图片("对话框/新手主线") then
		点击对话框("新手主线")
		等待对话框出现()
	end

	if 存在图片("对话框/对话框-战斗") then
		点击对话框("对话框-战斗")
	end

	if 存在图片("对话框/王夫人任务") then
		点击对话框("王夫人任务")
	end

end

function task000879()
	点击下划线()
	对话(60, -60)
	点击对话框("新手主线")
end

--休息好啦
function task000880()
	点击下划线()
	对话(60, -60)
	点击对话框("新手主线")
end


function task000872()
	点击下划线()
	点击坐标(640/2 - 50, 480/2) --移开一点
	等待停止奔跑()
	点击图片("战斗", 0, 50)
	点击对话框("新手主线")
	点击对话框("对话框-战斗")
end


function task000870()
	点击下划线()
	对话(60, -60)
	点击对话框("新手主线")
	点击对话框("不想住店", -60, -20)
end



--领取双倍
function task000873()


	if 当前城市("长安城") then
		点击下划线()
		对话()
		点击对话框("新手主线")
		点击对话框("领取四小时", 0, -50)
	else
		装备物品("红色合成旗", 1)
		点击图片("红色合成旗-歌", -40, 40)
	end

end

--大唐国境外战斗
function task000855()

	if 存在任务("心魔宝珠完成标志") then
		调试信息("交心魔宝珠完成任务")
		
		if 当前城市("长安城") == false then
			装备物品("红色合成旗", 1)
			点击图片("红色合成旗-歌", -40, 40)
			延迟(4)
		end

		点击下划线()
		对话()
		点击对话框("新手主线")
		点击对话框("我完成任务回来了")
	end


	if 当前城市("长安城") then
		前往("小地图-大唐国境")
	elseif 当前城市("大唐国境") then

		while(true) do
		--如果匹配到 20个 就回长安城了
			点击坐标(100, 300)
			点击坐标(400, 300)
		end
	end
end

--归还双倍经验
function task000857()
	点击下划线()
	对话()
	点击对话框("新手主线")
	点击对话框("领取四小时", 0, 20)
	点击对话框("取消", 0, -20)
end


--送信师门任务
function task000850()
	调试信息("没写")
	--if 当前城市("长安城") then
	--	点击下划线()
	--	等待停止奔跑()
	--	鼠标移动到(640, 480)
	--	按键("ALT+G")
	--	点击()
	--else
	--	装备物品("红色合成旗")
	--	点击图片("小地图/小地图-中间", 39, 26)
	--end

end
function task000845()
	if 当前城市("盘丝岭") then
		点击下划线()
		对话(30, -30)
		点击对话框("新手主线")
	elseif 当前城市("盘丝洞") then
		点击下划线()
		对话(30, -30)
		点击对话框("新手主线")
	else
		按键("F8")
	end
end

function task000841()
	点击下划线()
	if 当前城市("长安城") then
		对话(20, -20)
		点击对话框("新手主线")
		点击对话框("对话框-战斗")
	else
		点击传送门()
	end

end


function task000840()
	if 当前城市("化生寺") then
		点击下划线()
		等待停止奔跑()
		对话()
		点击对话框("新手主线")
	end

	点击下划线()
	点击坐标(600, 60)
end

function task000871()
	点击下划线()
	对话(20, -60)
	点击对话框("新手主线")
end


function task000839()
	点击下划线()
	对话(40, -10)
	点击对话框("新手主线")
end

function task000700()
	点击下划线()
	点击图片("战斗", 0, 50)
	点击对话框("对话框-战斗")
end

function task000702()
   使用辅助技能("烹饪")
end


function task000703()
	点击下划线()
	对话()
    点击对话框("对话框-战斗")
end

function task000705()
   玩家宠物("参战")
end

function 玄大夫()
   点击下划线()
   对话()
   点击对话框("玄大夫治病")
end


function 地图找平儿()
   点击小地图("去找萍儿")
   对话()
end

function task000888()
   点击下划线()
   对话()
   点击对话框("这就上船啦")
end

function task000640()
   点击下划线()
   对话()
	点击对话框("我知道了")
end

function task000642()
   点击下划线()
   对话()
   点击对话框("新手主线")
   点击对话框("task000432")
   点击图片("task000437", 0.9)    --程度到9, 不然容易点到菩提祖师...
end

function task000438()
	点击下划线()
	等待标识消失()
	对话(30, -10)
	点击对话框("新手主线")
	点击对话框("task000440")
	点击对话框("task000441")
end



function 学习蛛丝阵法任务()
	点击下划线()
	对话(30, -40)
	点击对话框("新手主线")
	点击对话框("学习技能")

	点击图片("蛛丝阵法技能", 0.9)
	x,y = 获得图片位置("学习按钮")
	
	次数 = 0
	while 次数 < 5 do
		点击坐标(x, y)
		次数 = 次数 + 1
	end
end

function 学习移形幻影任务()
	点击下划线()
	对话(30, -40)
	点击对话框("新手主线")
	点击对话框("学习技能")

	点击图片("移形幻影技能", 0.9)
	x,y = 获得图片位置("学习按钮")
	次数 = 0
	while 次数 < 5 do
		点击坐标(x, y)
		次数 = 次数 + 1
	end
end

function task000448()
	推荐加点()
end


function task000455()
	按键("ALT+E")
	右击("task000456")
end


function task000747()
	装备物品("飞行符", 1)
	点击图片("传送_建业", 30, 0)
end

function task000461()
	点击下划线()
	对话(20, -30)
	点击对话框("新手主线")
end



function task000463()
	点击下划线()
	对话(60, -60)
	点击对话框("新手主线")
end

function task000465()
	点击下划线()
	对话(-20, -20)
	点击对话框("新手主线")
end

function task000467()
	点击下划线(1)
	对话(60, -60, 1)
	点击图片("确定给予")
end

function task000469()
	点击下划线()
	x = 640/2
	y = 480/2

	按键("F9")
	移动鼠标到(x + 15, y - 70)
	按键("ALT+G")
	点击(0, 10)
	移动鼠标到(100, 100)
	右击("物品/红烧鱼")
	点击图片("确定给予")
end

function task000475()
	点击下划线(1)
	对话()
	点击对话框("新手主线")
	点击图片("确定给予")
end


function task000477()
	点击下划线()
		
	if 当前城市("建邺民居内室") then
		对话(-100, 29)
		点击对话框("新手主线")
	elseif 当前城市("建邺民居") then
		点击坐标(100, 100)
	end
end


function task000706()

	if 当前城市("沉船内室") then
		点击下划线()
		对话()
		点击对话框("新手主线")
		点击对话框("对话框-战斗")
	else
		点击下划线()
		点击坐标(420, 300)
	end

end

function task000479()

	if 当前城市("沉船内室") then
		点击下划线()
		对话()
		点击对话框("新手主线")
		点击对话框("对话框-战斗")
	elseif 当前城市("东海湾") then
		点击下划线()
		对话()
	else
		点击下划线()
		点击坐标(420, 300)

		走到旁边("task000482")
		对话()
	end

end


function task000483()
	点击下划线()
	点击图片("战斗", 0, 50)
	点击对话框("新手主线")
	点击对话框("对话框-战斗")
end


function task000485()
	点击下划线()
end

function task000486()

	点击下划线()
	对话(-20, -20)
	点击对话框("新手主线")
	点击对话框("task000488")
end

--描述: 新手支线点击界
function task000709()
	推荐加点()
	关闭无关窗口()
	玩家宠物("宠物推荐加点按钮")
	点击图片("确认加点按钮")
end


function task000711()
	if 当前城市("建邺民居内室") then
		点击下划线()
		对话(-100, 29)
		点击对话框("新手主线")
	else
		点击下划线()
	end
end


--天蚕丝给晶晶姑娘复命
function task000722()
	if 当前城市("盘丝岭") then
		点击下划线(3)
	elseif 当前城市("盘丝洞") then
		点击下划线(2)
		对话(30, -30)
		点击对话框("新手主线")
	else
		按键("F8")  --天蚕丝
	end

end

function task000723()

	if 当前城市("长安城") then
		点击下划线()
		对话(0, -60)
		点击对话框("新手主线")
	else
		装备物品("红色合成旗", 1)
		点击图片("红色合成旗-歌", -40, 40)
	end
end

function task000496()
	点击下划线()
	对话(-10, -30)
	点击对话框("新手主线")	
end

function task000724()
	点击下划线()
	对话(70, -60)
	点击对话框("新手主线")
end

function task000725()
	点击下划线()
	对话(10, -30)
	点击对话框("新手主线")
	点击对话框("对话框-战斗")
end


function task000749()
	if(当前城市("长安城")) then 
		前往("小地图-大唐官府")
	end
end


--王夫人任务开始..这里停掉, 去做日常
function task000726()
	点击下划线()
	对话()
	点击对话框("新手主线")
end

function yq000013()
	--领取日常任务("除暴安良")
	--继续做主线
	点击下划线()

	对话()
	点击对话框("新手主线")
	点击对话框("我只是路过", 0, -20)

end



--召唤兽支线 不满气血和忠诚
function task000752()
	点击下划线()
	对话(-40, 40)
	点击对话框("新手主线")
	点击对话框("补满召唤兽")
end

--打工支线
function task000754()
	点击下划线()
	按键("F9")
	对话()
	点击对话框("新手主线")
	点击对话框("选择我要做的事情")
	点击对话框("打工赚取现金")
end

function task000778()
	点击下划线()
	对话()
	点击对话框("新手主线")
	点击对话框("什么都不想做", -50, -20)
	点击图片("物品/丝绸长裙")
	点击图片("卖出按钮")
	点击对话框("我不卖呢", 0, -20)
end


function task001028()
	领取日常任务("除暴安良")	
end


--function 完成王夫人任务()
--	点击下划线()
--	等待停止奔跑()
--	对话()
--	点击对话框("新手主线")
--	点击对胡框内图片("好啊我正闲着呢")
--end

--function 
--	领取日常任务("王夫人")
	

--end


--师门任务
--function 方巾()
--	--使用飞行符号
--	--传送到长安
--	--走到 布 店
--	--点击老板
--	--购买方巾
--end


--脚本加载标志
已经加载战斗脚本 = false

--开始
function 脚本入口()
	
	延迟(1)

	if 已经加载战斗脚本 == false then
		调试信息("加载战斗脚本")
		dofile("任务-战斗.lua")
		已经加载战斗脚本 = true
	end

	检测需要人工()
	检测离线()
	关闭无关窗口()
	等待标识消失()
	处理死亡()




	状态 = 获取玩家状态()
	if 状态 == 战斗状态 then
		脚本_战斗结束 = true
		if 存在图片("战斗-菜单2", 0.8) then
			战斗回调()
		elseif 存在图片("宠物战斗菜单", 0.8) then
			宠物战斗回调()
		end

	elseif 状态 == 正常状态 then

		匹配到任务 = 匹配任务()
		if (匹配到任务 == false) then
			通用_主线()
		end

	elseif 状态 == 动画状态 then
		点击图片("跳过动画")
	else
		调试信息("未知状态..")
	end

end