



function 脚本入口()

	关闭无关窗口()
	--加血()

	if 存在图片("长寿郊外") then
		if 当前城市("长寿郊外") then
			点击下划线()
		else
			前往("小地图-长寿郊外")
		end
	elseif 存在图片("西梁女国") then
		if 当前城市("西梁女国") then
			点击下划线()
		else
			前往("西梁女国")
		end

	elseif 存在图片("江南野外") then
		if 当前城市("江南野外") then
			点击下划线()
		else
			前往("小地图-江南野外")
		end
	elseif 存在图片("宝象国") then
		if 当前城市("宝象国") then
			点击下划线()
		else
			前往("宝象国")
		end
	elseif 存在图片("花果山") then

		if 当前城市("花果山") then
			点击下划线()
		else
			前往("花果山")
		end

	elseif 存在图片("建邺城") then
		if 当前城市("建邺城") then
			点击下划线()
		else
			前往("建邺城")
		end
	else
		调试信息("没有找到任务, 开始接任务")
		
		if 当前城市("长安城") then
			点击坐标(625, 225)
			等待停止奔跑()
			隐藏玩家()
			点击图片("杜少海", 0.5)
			点击对话框("告诉我怎么做吧")
		else
			装备物品("红色合成旗")
			点击图片("小地图/长安城-布")
		end

	end





end


