--[[

日常脚本的写法

做那个日常是外挂决定出来的, 外挂会通过屏幕匹配确定7个日常该做哪个



]]



function 去领镖()

	::重试::
	关闭无关窗口()
	if 当前城市("长安城") then
		按键("TAB")
		点击坐标(570, 213)
		按键("TAB")
		等待停止奔跑()
		点击坐标(485, 84) --进门
	elseif 当前城市("长风镖局") then
		点击坐标(620, 480/2) --右边点一次
		等待停止奔跑()
		--按键("F9")
		--走到旁边("跑镖任务领取人")
		隐藏玩家()
		走到旁边("跑镖任务领取人")
		隐藏玩家()
		变动点击("跑镖任务领取人")
		点击对话框内图片("task000575")
		点击对话框内图片("task000576")
	end
	
end


function 跑镖结束给予(NPC名字)
	--走到旁边(NPC名字)
	隐藏玩家()
	local x, y = 移动鼠标到(NPC名字, 5)
	按键("ALT+G") --给予
	点击(x, y)
	右击("物品\\二级镖")
	变动点击("确定给予")

	--回去
	装备物品("白色导标旗")
	点击对话框内图片("送我去那里")
end

function 出领取跑镖门()
	if(当前城市("长风镖局")) then 点击坐标(50, 480/2) end
	if(当前城市("长风镖局")) then 点击坐标(50, 480/2 + 50) end
	if(当前城市("长风镖局")) then 点击坐标(50, 480/2 + 50) end
end

function 找驿站老板()

	::重试::
	
	if(当前城市("长安城")) then
		点击小地图("小地图-赌");
		隐藏玩家()

		if(存在图片("驿站老板", 5)) then 
			走到旁边("驿站老板", 5)
			隐藏玩家()
			变动点击("驿站老板", 5)

		elseif(存在图片("驿站老板1", 5)) then
			走到旁边("驿站老板1", 5)
			隐藏玩家()
			变动点击("驿站老板1", 5)

		elseif(存在图片("跑镖-驿站老板2", 5)) then 
			走到旁边("跑镖-驿站老板2", 5)
			隐藏玩家() 
			变动点击("跑镖-驿站老板2", 5)

		elseif(存在图片("跑镖-驿站老板3", 5)) then 
			走到旁边("跑镖-驿站老板3", 5)
			隐藏玩家()  
			变动点击("跑镖-驿站老板3", 5) 
		else
			调试信息("竟然没有找到...重试")
			goto 重试
		end

		if(存在图片("对话框\\对话框-是的我要去")) then
			点击对话框内图片("对话框-是的我要去");
		else
			goto 重试
		end
		
	end
end


function _程咬金()

	出领取跑镖门()

	if 当前城市("长安城") then
		点击小地图("小地图-国子监", 40, -50)
		点击坐标(200, 47) --传送门
	end

	if 当前城市("大唐官府") then
	--进入到程咬金的屋子里后
		点击小地图("小地图-程咬金-屋子")
		点击坐标(200, 200)  --进屋子
	end

	if 当前城市("程咬金府") then
		跑镖结束给予("程咬金")
	end

end

function _秦琼()

	出领取跑镖门()

	if 当前城市("长安城") then 
		点击小地图("小地图-秦琼");
		if 当前城市("长安城") then 点击坐标(200, 200) end
		if 当前城市("长安城") then 点击坐标(200, 200) end
		if 当前城市("长安城") then 点击坐标(200, 200) end
	end
	
	if 当前城市("秦琼府") then
		点击坐标(100, 100)
		跑镖结束给予("跑镖-秦琼")
	end

end

function _镇元大仙()
	出领取跑镖门()

		if(当前城市("长安城")) then
			找驿站老板()
		end

		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -50, 0)
			点击坐标(50, 480/2)
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-五庄观", 50, 0)
			点击坐标(510, 94);
			点击坐标(510, 94);
		end

		if(当前城市("五庄观")) then
			点击小地图("小地图-镇元大仙-屋子")
			点击坐标(510, 94);
		end

		if(当前城市("乾坤殿")) then
			点击坐标(510, 94);
			跑镖结束给予("跑镖-镇元大仙", 3)
		end
end
function _空度禅师()
		出领取跑镖门()

		if 当前城市("长安城") then
			点击小地图("小地图-化生寺", -20, -30)
			点击坐标(510, 94)  --传送门
		end

		if(当前城市("化生寺")) then 
			点击小地图("跑镖-化生寺-屋子")
			点击坐标(440, 150)  --传送门
		end

		if 当前城市("藏经阁") then
			隐藏玩家()
			跑镖结束给予("跑镖-空度禅师")
		end
			
end

function _大大王()

		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -55, -5);
			点击坐标(30, 480/2)  --进传送门
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-狮坨岭1", -40, -10);
			点击坐标(25, 480/2 - 50) --进传送门
		end

		if(当前城市("狮坨岭")) then
			点击小地图("小地图-大大王");  --点的是小地图位置
			点击坐标(510, 94);      --进传送门
		end

		if(当前城市("狮王洞")) then
			跑镖结束给予("跑镖-大大王")
		end


end

function  _地藏王()
	出领取跑镖门()
	找驿站老板()
		
	if(当前城市("大唐国境")) then
		点击小地图("小地图-地府", -20, -5)
		点击坐标(100, 100)  --传送门
	end

	if 当前城市("地府") then 
		点击小地图("小地图-地府-屋子")
		点击坐标(100, 100)
	end

	if 当前城市("森罗殿") then
		if 当前城市("森罗殿") then 点击坐标(240, 10) end
		if 当前城市("森罗殿") then 点击坐标(240, 10) end
		if 当前城市("森罗殿") then 点击坐标(240, 10) end
	end

	if 当前城市("地藏王府") then
		跑镖结束给予("跑镖-地藏王")
	end

end
    
function _观音姐姐()
			
	出领取跑镖门()
	找驿站老板()

	if 当前城市("大唐国境") then
		点击小地图("小地图-普陀山", -30, -5);
		隐藏玩家()
		变动点击("跑镖-普陀接引仙女")
		点击对话框内图片("对话框-是的我要去")
	end

	if 当前城市("普陀山") then
		点击小地图("小地图-潮音洞", -30, -5);
		点击坐标(20, 150)  --传送门
	end
	
	if 当前城市("潮音洞") then
		点击坐标(100, 100)
		点击坐标(100, 100)
		点击坐标(100, 100)
		跑镖结束给予("跑镖-观音姐姐")
	end
end

function _牛魔王()

		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -55, -5);
			点击坐标(30, 480/2)  --进传送门
		end
		
		点击小地图("魔王寨")
		点击左上角();
		点击小地图("地图-魔王寨");
		点击右上角();
		
		跑镖结束给予()
		
end    

function _二大王()
		出领取跑镖门()
		找驿站老板()
		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -55, 0);
			点击坐标(30, 480/2);
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-狮坨岭1", -40, -10);
			点击坐标(50, 480/2)  --进传送门
		end

		if(当前城市("狮坨岭")) then
			点击小地图("小地图-二大王");  --点的是小地图位置
			点击坐标(640/2, 100)
		end

		跑镖结束给予("跑镖-二大王")

end
	
function _孙婆婆()
	出领取跑镖门();
	if(当前城市("长安城")) then 
		点击小地图("小地图-江南野外1", 50, 5)
		点击坐标(530, 399)
	end

	if(当前城市("江南野外")) then
		点击小地图("小地图-建邺城3")
		点击坐标(620, 100);
	end

	if(当前城市("建邺城")) then
		点击小地图("小地图-东海湾1")
		点击坐标(620, 480 /2 + 100);
	end

	::重试::
	if(当前城市("东海湾")) then
		点击小地图("小地图-傲来国")
		隐藏玩家()
		if(存在图片("驿站老板", 5)) then 
			变动点击("驿站老板", 5)
		elseif(存在图片("驿站老板1", 5)) then  
			变动点击("驿站老板1", 5) 
		elseif(存在图片("跑镖-驿站老板2", 5)) then  
			变动点击("跑镖-驿站老板2", 5)  
		end

		if 存在图片("对话框-是的我要去") then
			点击对话框内图片("对话框-是的我要去", 5)
		else
			goto 重试
		end
	end

	if(当前城市("傲来国")) then
		点击小地图("小地图-女儿村2")
		点击坐标(100, 100)
	
	end
	
	if(当前城市("女儿村村长家")) then   --这个顺序
		跑镖结束给予("跑镖-孙婆婆")
	end
	
	if(当前城市("女儿村")) then
		点击小地图("小地图-女儿村-屋子")
		点击坐标(100, 480/2)
	end
end

--从接跑镖任务进门开始
function 跑镖开始()
	关闭无关窗口()
	检查血量()


	if(存在图片("程咬金")) then
		_程咬金()
	elseif 存在任务("日常-跑镖-程咬金1") then
		_程咬金()
	elseif(存在任务("日常-跑镖-观音姐姐1")) then
		_观音姐姐()
	elseif(存在任务("日常-跑镖-观音姐姐")) then
		_观音姐姐()
		
	elseif(存在任务("日常-跑镖-大大王2")) then
		_大大王()
		
	elseif(存在任务("日常-跑镖-大大王")) then

		_大大王()
	
	elseif 存在任务("日常-跑镖-牛魔王1") then
		_牛魔王()
	elseif(存在任务("日常-跑镖-牛魔王")) then
		_牛魔王()
	elseif(存在任务("日常-跑镖-晶晶姑娘")) then

		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -55, -5)
			点击坐标(30, 480/2);
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-盘丝岭1", 40, 0)
			点击坐标(640 / 2, 50)
		end
	
		if 当前城市("盘丝岭") then
			点击小地图("小地图-盘丝岭-屋子");
			点击坐标(510, 94);
		end
		
		if 当前城市("盘丝洞") then
			点击坐标(200, 20)
			点击坐标(200, 20)  --找静静姑娘
			点击坐标(640/2 + 100, 480/2 - 100)
			跑镖结束给予("跑镖-晶晶姑娘")
		end
	
	elseif(存在任务("日常-跑镖-三大王")) then
		出领取跑镖门()
		找驿站老板()

		if 当前城市("大唐国境") then
			点击小地图("小地图-大唐境外2", -55, -5);
			点击坐标(50, 480/2);
		end

		if 当前城市("大唐境外") then
			点击小地图("小地图-狮坨岭1", -40,-10);
			点击坐标(30, 480/2)
		end


		if 当前城市("狮坨岭") then
			点击小地图("小地图-三大王");
			点击坐标(640/2, 20)
		end

		if 当前城市("老雕洞") then
			跑镖结束给予("跑镖-三大王.png")
		end

	elseif(存在任务("日常-跑镖-二大王1")) then

		_二大王()
				
	elseif(存在任务("日常-跑镖-二大王")) then

		_二大王()

	elseif(存在任务("日常-跑镖-春十三娘")) then

		出领取跑镖门()
		找驿站老板()

		if 当前城市("大唐国境") then
			点击小地图("小地图-大唐境外2", -55, 0);
			点击坐标(50, 480/2);
		end
		
		if 当前城市("大唐境外") then
				点击小地图("小地图-盘丝岭1", 40, 0)
				点击坐标(640 / 2, 50)
		end

		if 当前城市("盘丝岭") then
			点击小地图("小地图-盘丝岭-屋子");
			点击坐标(510, 94);
		end
		
		if 当前城市("盘丝洞") then
			点击坐标(640/2, 480/2)
			隐藏玩家()
			跑镖结束给予("跑镖-春十三娘");
		end

	elseif(存在任务("日常-跑镖-李靖")) then
		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -55, 0);
			点击坐标(50, 480/2);  --传送门
			点击坐标(50, 480/2);  --传送门
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-长寿郊外", -45, -5);
			点击坐标(100, 480/2);
			隐藏玩家()
			走到旁边("跑镖-传送长寿郊外NPC")
			变动点击("跑镖-传送长寿郊外NPC")
			点击对话框内图片("对话框-是的我要去")
		end

		if(当前城市("长寿郊外")) then
			点击小地图("小地图-天宫")
			隐藏玩家()
			变动点击("跑镖-天将")
			点击对话框内图片("对话框-是的我要去")
		end

		
		if(当前城市("天宫")) then
			点击小地图("小地图-天宫-屋子")
			点击坐标(200, 200)  --进传送门
		end

		if(当前城市("凌霄宝殿")) then
			点击坐标(50, 480 /2)
			点击坐标(50, 480 /2)
			点击坐标(50, 480 /2)
			点击坐标(50, 480 /2) --靠近李靖
		end

		跑镖结束给予("跑镖-李靖")
	elseif(存在任务("日常-跑镖-杨戬")) then	
		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -55, 0);
			点击坐标(50, 480/2);  --传送门
			点击坐标(50, 480/2);  --传送门
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-长寿郊外", -45, -5);
			点击坐标(100, 480/2);
			隐藏玩家()
			走到旁边("跑镖-传送长寿郊外NPC")
			变动点击("跑镖-传送长寿郊外NPC")
			点击对话框内图片("对话框-是的我要去")
		end

		if(当前城市("长寿郊外")) then
			点击小地图("小地图-天宫")
			隐藏玩家()
			变动点击("跑镖-天将")
			点击对话框内图片("对话框-是的我要去")
		end

		
		if(当前城市("天宫")) then
			点击小地图("小地图-天宫-屋子")
			点击坐标(121, 121)  --进传送门
		end

		if(当前城市("凌霄宝殿")) then
			点击坐标(50, 480 /2)
		end

		跑镖结束给予("跑镖-杨戬")
		
	elseif 存在任务("日常-跑镖-秦琼1") then
		_秦琼()
	elseif(存在任务("日常-跑镖-秦琼")) then
		_秦琼()
	elseif(存在任务("日常-跑镖-菩提祖师1")) then
		出领取跑镖门()
		找驿站老板()
		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -55, 0)
			点击坐标(50, 480/2)
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-长寿郊外", -45, -5)
			隐藏玩家()
			--走到旁边("跑镖-传送长寿郊外NPC")
			--隐藏玩家()
			变动点击("跑镖-传送长寿郊外NPC")
			点击对话框内图片("对话框-是的我要去")
		end		

		
		if(当前城市("长寿郊外")) then
			点击小地图("小地图-长寿村", 50, 0)
			点击坐标(640/2, 30)
		end		

		if(当前城市("长寿村")) then
			点击小地图("小地图-方寸山", 50, 0)
			点击坐标(640/2, 20)
		end		
	
		if(当前城市("方寸山")) then
			点击小地图("跑镖-菩提祖师-屋子")
			点击坐标(500, 100)
		end		

		if(当前城市("灵台宫")) then
			点击坐标(499, 88)
			点击坐标(499, 88)
			跑镖结束给予("跑镖-菩提祖师")
		end		
				
	elseif(存在任务("日常-跑镖-空度禅师1")) then
		
		_空度禅师()
	elseif(存在任务("日常-跑镖-空度禅师")) then
		_空度禅师()
	elseif(存在任务("日常-跑镖-地藏王1")) then
		_地藏王()
	elseif(存在任务("日常-跑镖-地藏王")) then
		_地藏王()
	elseif(存在任务("日常-跑镖-孙婆婆1")) then
		_孙婆婆()
	elseif(存在任务("日常-跑镖-孙婆婆")) then
		_孙婆婆()
	elseif(存在任务("日常-跑镖-镇元大仙")) then
		_镇元大仙()
	elseif(存在任务("日常-跑镖-镇元大仙1")) then
		_镇元大仙()
	elseif(存在任务("日常-跑镖-东海龙王")) then
		出领取跑镖门()
		
		if(当前城市("长安城")) then
			点击小地图("小地图-江南野外1", 50, 5)
			点击坐标(600, 420)
		end

		if(当前城市("江南野外")) then
			点击小地图("小地图-建邺城3")
			点击坐标(620, 100);
		end
		
		if(当前城市("建邺城")) then
			点击小地图("小地图-东海湾", 20, 0)
			点击坐标(620, 100);
		end
			
		if(当前城市("东海湾")) then
			点击小地图("小地图-龙宫", 0, -40)
			隐藏玩家()
			变动点击("跑镖-东海老虾传送")
			点击对话框内图片("对话框-是的我要去")
		end
				
		if(当前城市("龙宫")) then
			点击小地图("跑镖-龙宫-屋子")
			点击坐标(437, 148)
		end	
				
		if(当前城市("水晶宫")) then
			点击坐标(640 /2  + 100, 480/2)  --靠近龙王
			点击坐标(640 /2  + 100, 480/2)  --靠近龙王
				
			跑镖结束给予("跑镖-东海龙王")
		end	
	else
		去领镖()
	end

end



--脚本加载标志
已经加载战斗脚本 = false

--开始
function 脚本入口()

	调试信息("进入脚本")



--选择处理战斗的脚本
	if false == 已经加载战斗脚本 then
		调试信息("加载战斗脚本")
		dofile("日常-战斗.lua")
		已经加载战斗脚本 = true
	end

	玩家状态 = 获取玩家状态()
	if 玩家状态 == 战斗状态 then
		战斗回调()
	elseif 玩家状态 == 正常状态 then
			跑镖开始()

	end


end