--[[

日常脚本的写法

做那个日常是外挂决定出来的, 外挂会通过屏幕匹配确定7个日常该做哪个



]]



function 去领镖()

	::重试::
	关闭无关窗口()
	if 当前城市("长安城") then
		按键("TAB")
		点击坐标(570, 213)
		按键("TAB")
		等待停止奔跑()
		点击坐标(485, 84) --进门
	elseif 当前城市("长风镖局") then
		点击坐标(620, 480/2) --右边点一次
		等待停止奔跑()
		--按键("F9")
		--走到旁边("跑镖任务领取人")
		隐藏玩家()
		走到旁边("跑镖任务领取人")
		隐藏玩家()
		点击图片("跑镖任务领取人")
		点击对话框("task000575")
		点击对话框("task000576")
	else
		--回去
		装备物品("红色合成旗", 1)
		点击图片("红色合成旗-药", -25, 15)
	end
	
end


function 跑镖结束给予(名字)
	调试信息("跑镖结束给予")
	--走到旁边(名字)
	隐藏玩家()
	local x, y = 获得图片位置(名字, 0.45)
	移动鼠标到(x, y)
	按键("ALT+G") --给予
	点击()
	移动鼠标到(100, 100)
	右击("物品\\二级镖")
	点击图片("确定给予")
end

function 出领取跑镖门()
	if(当前城市("长风镖局")) then 点击坐标(50, 480/2) end
	if(当前城市("长风镖局")) then 点击坐标(50, 480/2 + 50) end
	if(当前城市("长风镖局")) then 点击坐标(50, 480/2 + 50) end
end

function _程咬金()

	出领取跑镖门()

	if 当前城市("长安城") then
		前往("小地图-国子监")
	end

	if 当前城市("大唐官府") then
	--进入到程咬金的屋子里后
		前往("小地图-程咬金-屋子")
	end

	if 当前城市("程咬金府") then
		跑镖结束给予("程咬金")
	end

end

function _秦琼()

	出领取跑镖门()

	if 当前城市("长安城") then 
		前往("小地图-秦琼")
	end
	
	if 当前城市("秦琼府") then
		点击坐标(100, 100)
		等待停止奔跑()
		跑镖结束给予("跑镖-秦琼")
	end

end

function _镇元大仙()
	出领取跑镖门()

		if(当前城市("长安城")) then
			找驿站老板()
		end

		if(当前城市("大唐国境")) then
			前往("小地图-大唐境外")
		end

		if(当前城市("大唐境外")) then
			前往("小地图-五庄观")
		end

		if(当前城市("五庄观")) then
			前往("小地图-镇元大仙-屋子")
		end

		if(当前城市("乾坤殿")) then
			点击坐标(510, 94);
			跑镖结束给予("跑镖-镇元大仙", 3)
		end
end
function _空度禅师()
		出领取跑镖门()

		if 当前城市("长安城") then
			前往("小地图-化生寺")
		end

		if(当前城市("化生寺")) then 
			前往("小地图-化生寺-屋子")
		end

		if 当前城市("藏经阁") then
			隐藏玩家()
			跑镖结束给予("跑镖-空度禅师")
		end
			
end

    
function _观音姐姐()
			
	出领取跑镖门()
	找驿站老板()

	if 当前城市("大唐国境") then
		前往("小地图-普陀山")
	end

	if 当前城市("普陀山") then
		前往("小地图-潮音洞")
	end
	
	if 当前城市("潮音洞") then
		点击坐标(100, 100)
		点击坐标(100, 100)
		点击坐标(100, 100)
		跑镖结束给予("跑镖-观音姐姐")
	end
end

function _牛魔王()

	出领取跑镖门()
	找驿站老板()

	if(当前城市("大唐国境")) then
		前往("小地图-大唐境外")
	end
	
	if(当前城市("大唐境外")) then
		前往("小地图-魔王寨")
	end
	
	if(当前城市("魔王寨")) then
		前往("小地图-魔王寨-屋子")
	end
	
	跑镖结束给予("跑镖-牛魔王")
end    

	
function _孙婆婆()
	出领取跑镖门();
	if(当前城市("长安城")) then 
		前往("小地图-江南野外")
	end

	if(当前城市("江南野外")) then
		前往("小地图-建邺城")
	end

	if(当前城市("建邺城")) then
		前往("小地图-东海湾")
	end

	if(当前城市("东海湾")) then
		前往("小地图-傲来国")
	end

	if(当前城市("傲来国")) then
		前往("小地图-女儿村")
	end
	
	if(当前城市("女儿村村长家")) then   --这个顺序
		跑镖结束给予("跑镖-孙婆婆")
	end
	
	if(当前城市("女儿村")) then
		前往("小地图-女儿村-屋子")
	end
end

--从接跑镖任务进门开始
function 跑镖开始()
	关闭无关窗口()
	加血()

	if 存在任务("日常-跑镖-程咬金") then
		_程咬金()
	elseif(存在任务("日常-跑镖-观音姐姐")) then
		_观音姐姐()
		
	elseif(存在任务("日常-跑镖-大大王")) then
		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			前往("小地图-大唐境外")
		end

		if(当前城市("大唐境外")) then
			前往("小地图-狮坨岭")
		end

		if(当前城市("狮坨岭")) then
			前往("小地图-大大王")
		end

		if(当前城市("狮王洞")) then
			跑镖结束给予("跑镖-大大王")
		end

	elseif(存在任务("日常-跑镖-牛魔王")) then
		_牛魔王()
	elseif(存在任务("日常-跑镖-晶晶姑娘")) then

		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			前往("小地图-大唐境外")
		end

		if(当前城市("大唐境外")) then
			前往("小地图-盘丝岭")
		end
	
		if 当前城市("盘丝岭") then
			前往("小地图-盘丝岭-屋子")
		end
		
		if 当前城市("盘丝洞") then
			点击坐标(200, 20)
			延迟(1)
			点击坐标(200, 20)
			延迟(1)
			点击坐标(200, 20)  --找静静姑娘
			等待停止奔跑()
			点击坐标(640/2 + 100, 480/2 - 100)
			跑镖结束给予("跑镖-晶晶姑娘")
		end
	
	elseif(存在任务("日常-跑镖-三大王")) then
		出领取跑镖门()
		找驿站老板()

		if 当前城市("大唐国境") then
			前往("小地图-大唐境外")
		end

		if 当前城市("大唐境外") then
			前往("小地图-狮坨岭")
		end


		if 当前城市("狮坨岭") then
			前往("小地图-三大王")
		end

		if 当前城市("老雕洞") then
			跑镖结束给予("跑镖-三大王")
		end
	elseif(存在任务("日常-跑镖-二大王")) then

		出领取跑镖门()
		找驿站老板()
		if(当前城市("大唐国境")) then
			前往("小地图-大唐境外")
		end

		if(当前城市("大唐境外")) then
			前往("小地图-狮坨岭")
		end

		if(当前城市("狮坨岭")) then
			前往("小地图-二大王")
		end

		跑镖结束给予("跑镖-二大王")

	elseif(存在任务("日常-跑镖-春十三娘")) then

		出领取跑镖门()
		找驿站老板()

		if 当前城市("大唐国境") then
			前往("小地图-大唐境外")
		end
		
		if 当前城市("大唐境外") then
			前往("小地图-盘丝岭")
		end

		if 当前城市("盘丝岭") then
			前往("小地图-盘丝岭-屋子")
		end
		
		if 当前城市("盘丝洞") then
			点击坐标(640/2, 480/2)
			隐藏玩家()
			跑镖结束给予("跑镖-春十三娘");
		end

	elseif 存在任务("日常-跑镖-李靖") then
		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			前往("小地图-大唐境外")
		end

		if(当前城市("大唐境外")) then
			前往("小地图-长寿郊外")
		end

		if(当前城市("长寿郊外")) then
			前往("小地图-天宫")
		end

		if(当前城市("天宫")) then
			前往("小地图-天宫-屋子")
		end

		if(当前城市("凌霄宝殿")) then
			隐藏玩家()
			if 存在图片("跑镖-李靖", 0.5) then
				调试信息("找到李靖, 开始接近")
				走到旁边("跑镖-李靖", 0.5)
			else
				点击坐标(50, 480 /2)
				点击坐标(50, 480 /2)
			end

		end

		跑镖结束给予("跑镖-李靖")
	elseif(存在任务("日常-跑镖-杨戬")) then	
		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			前往("小地图-大唐境外")
		end

		if(当前城市("大唐境外")) then
			前往("小地图-长寿郊外")
		end

		if(当前城市("长寿郊外")) then
			前往("小地图-天宫")
		end

		
		if(当前城市("天宫")) then
			前往("小地图-天宫-屋子")
		end

		if(当前城市("凌霄宝殿")) then
			点击坐标(50, 480 /2)
		end

		跑镖结束给予("跑镖-杨戬")
		
	elseif(存在任务("日常-跑镖-秦琼")) then
		_秦琼()
	elseif(存在任务("日常-跑镖-菩提祖师")) then
		出领取跑镖门()
		找驿站老板()
		if(当前城市("大唐国境")) then
			前往("小地图-大唐境外")
		end

		if(当前城市("大唐境外")) then
			前往("小地图-长寿郊外")
		end		

		
		if(当前城市("长寿郊外")) then
			前往("小地图-长寿村")
		end		

		if(当前城市("长寿村")) then
			前往("小地图-方寸山")
		end		
	
		if(当前城市("方寸山")) then
			前往("小地图-菩提祖师-屋子")
		end		

		if(当前城市("灵台宫")) then
			点击坐标(499, 88)
			点击坐标(499, 88)
			跑镖结束给予("跑镖-菩提祖师")
		end		

	elseif(存在任务("日常-跑镖-空度禅师")) then
		_空度禅师()
	elseif(存在任务("日常-跑镖-地藏王")) then

		出领取跑镖门()
		找驿站老板()
			
		if(当前城市("大唐国境")) then
			前往("小地图-地府")
		end

		if 当前城市("地府") then 
			前往("小地图-地府-屋子")
		end

		if 当前城市("森罗殿") then
			if 当前城市("森罗殿") then 点击坐标(240, 10) end
			if 当前城市("森罗殿") then 点击坐标(240, 10) end
			if 当前城市("森罗殿") then 点击坐标(240, 10) end
		end

		if 当前城市("地藏王府") then
			跑镖结束给予("跑镖-地藏王")
		end
	elseif(存在任务("日常-跑镖-孙婆婆")) then
		_孙婆婆()
	elseif(存在任务("日常-跑镖-镇元大仙")) then
		_镇元大仙()
	elseif(存在任务("日常-跑镖-东海龙王")) then
		出领取跑镖门()
		
		if(当前城市("长安城")) then
			前往("小地图-江南野外")
		end

		if(当前城市("江南野外")) then
			前往("小地图-建邺城")
		end
		
		if(当前城市("建邺城")) then
			前往("小地图-东海湾")
		end
			
		if(当前城市("东海湾")) then
			前往("小地图-龙宫")
			隐藏玩家()
			点击图片("跑镖-东海老虾传送")
			点击对话框("对话框-是的我要去")
		end
				
		if(当前城市("龙宫")) then
			前往("小地图-龙宫-屋子")
		end	
				
		if(当前城市("水晶宫")) then
			点击坐标(640 /2  + 100, 480/2)  --靠近龙王
			点击坐标(640 /2  + 100, 480/2)  --靠近龙王
				
			跑镖结束给予("跑镖-东海龙王")
		end	
	else
		调试信息("没有找到跑镖任务, 开始领取任务")
		去领镖()
	end

end



--脚本加载标志
已经加载战斗脚本 = false

--开始
function 脚本入口()

	延迟(1)
	调试信息2("开始跑镖...")

--选择处理战斗的脚本
	if false == 已经加载战斗脚本 then
		调试信息("加载战斗脚本")
		dofile("日常-战斗.lua")
		已经加载战斗脚本 = true
	end


	玩家状态 = 获取玩家状态()
	if 玩家状态 == 战斗状态 then
		战斗回调()
	elseif 玩家状态 == 正常状态 then
		跑镖开始()
	end

end