
脚本_靠近左面 = false

--没有匹配到任务的时候, 但是有可点击的下划线时调用这个函数
function 通用_主线()
	调试信息("默认的任务处理")
	除暴安良中 = false

	--除暴安良任务中, 其他地图都去长安城
	if 存在图片("除暴安良-任务标志") then
		调试信息("除暴安良任务标志被设置")
		除暴安良中 = true
	else
		领取日常任务("除暴安良")
		return
	end

	等待标识消失()
	关闭无关窗口()
    点击下划线()

	隐藏玩家()
	
	if 除暴安良中 then
		调试信息("除暴安良中..")
		--点击图片("隐藏任务按钮")
		if 当前城市("长安城") == false then
			调试信息("除暴安良时, 当前城市不在长安城")
			调试信息("点击传送门")
			点击传送门()
		end
	end



	if 存在图片("战斗", 0.5) then
		调试信息("通过任务处理中检测到战斗标志")
		x, y = 获得图片位置("战斗", 0.5)
		if x < 200 then
			移动鼠标到(x, y + 70)
			确保接触到NPC()
			按键("ALT+A")
			点击()
		else
			--靠近到右面
			if 脚本_靠近左面 then
				点击图片("战斗", 50, 50)  --靠近
				脚本_靠近左面 = false
			else
				点击图片("战斗", -50, 50)  --靠近
				脚本_靠近左面 = true
			end

			等待停止奔跑()

			隐藏玩家()
	
			x, y = 获得图片位置("战斗", 0.5)	
			移动鼠标到(x, y + 70)
			确保接触到NPC()
			点击()  --对话
			等待对话框出现()
		end

		
	
		if 存在图片("对话框/新手主线") then
			点击对话框("新手主线")
			点击对话框("对话框-战斗")
		end

		if 存在图片("对话框/对话框-战斗") then
			点击对话框("对话框-战斗")
		end

		if 存在图片("对话框/还是先闪为妙") then
			点击对话框("还是先闪为妙", 0, -21)
		end

		点击对话框("算了不打扰了", 0, -25)
		return
	end



   	对话()

	if 存在图片("对话框/新手主线") then
		点击对话框("新手主线")
		等待对话框出现()
	end

	if 存在图片("对话框/算了不打扰了") then
		点击对话框("算了不打扰了", 0, -25)
	end

	if 存在图片("对话框/还是先闪为妙") then
		点击对话框("还是先闪为妙", 0, -21)
	end
end


--脚本加载标志
已经加载战斗脚本 = false

--开始
function 脚本入口()

	if 已经加载战斗脚本 == false then
		调试信息("加载战斗脚本")
		dofile("任务-战斗.lua")
		已经加载战斗脚本 = true
	end

	检测离线()
	关闭无关窗口()
	等待标识消失()
	处理死亡()

	状态 = 获取玩家状态()
	if 状态 == 战斗状态 then

		if 存在图片("战斗-菜单2", 0.8) then
			战斗回调()
		elseif 存在图片("宠物战斗菜单", 0.8) then
			宠物战斗回调()
		end

	elseif 状态 == 正常状态 then

		加血()
		匹配到任务 = 匹配任务()
		if (匹配到任务 == false) then
			if 存在图片("除暴安良-任务标志") then
				通用_主线()
			else
				领取日常任务("除暴安良")

			end
		end

	elseif 状态 == 动画状态 then
		点击图片("跳过动画")
	else
		调试信息("未知状态..")
	end

	关闭无关窗口()

end




--大唐国飞贼  除暴安良日常
function task000728()
	if(当前城市("长安城")) then
		前往("小地图-大唐国境")
	elseif 当前城市("大唐国境") then
		点击坐标(100, 480/2)
		点击坐标(50, 480/2)
	end
end

--化生寺飞贼  除暴安良日常
function task000733()

	if 当前城市("化生寺") then
		点击坐标(100, 480/2)
		等待停止奔跑()
		点击坐标(50, 480/2)
	else
		前往("小地图-化生寺")
	end
end

--江南野外
function task000902()
	if 当前城市("江南野外") == false then
		点击坐标(100, 480/2)
		点击坐标(300, 480/2)
	elseif 当前城市("长安城") then
		前往("小地图-江南野外")
	else
		装备物品("红色合成旗")
		点击图片("红色合成旗-歌", -40, 40)
	end

end

--有坐标的
function task000905()
	if 当前城市("江南野外") == false then
		装备物品("红色合成旗")
		点击图片("红色合成旗-歌")
	elseif 当前城市("长安城") then
		前往("小地图-江南野外")
	else
		通用_主线()		
	end

end


--大唐国境 指定怪
function task000901()
	if(当前城市("长安城")) then
		前往("小地图-大唐国境")
	elseif 当前城市("大唐国境") then
		调试信息("当前在大唐国境")
		通用_主线()

	end	
end