--[[

日常脚本的写法

做那个日常是外挂决定出来的, 外挂会通过屏幕匹配确定7个日常该做哪个



]]


--给外挂声明这个脚本能处理的日常
日常={
"日常1"
}

function 跑镖结束给予(NPC名字)
	--走到旁边(NPC名字)
	隐藏玩家()
	local x, y = 移动鼠标到(NPC名字, 5)
	按键("ALT+G") --给予
	点击(x, y)
	右击("二级镖")
	点击图片("确定给予")
end

function 出领取跑镖门()
	if(当前城市("长风镖局")) then 点击坐标(50, 480/2) end
	if(当前城市("长风镖局")) then 点击坐标(50, 480/2) end
	if(当前城市("长风镖局")) then 点击坐标(50, 480/2) end
end

function 找驿站老板()
	if(当前城市("长安城")) then
		点击小地图("地图-赌");
		隐藏玩家()
		if(存在图片("驿站老板", 5)) then 点击图片("驿站老板", 5) end
		if(存在图片("驿站老板1", 5)) then  点击图片("驿站老板1", 5)  end
		if(存在图片("跑镖-驿站老板2", 5)) then  点击图片("跑镖-驿站老板2", 5)  end
			if(存在图片("跑镖-驿站老板3", 5)) then  点击图片("跑镖-驿站老板3", 5)  end
	
		点击对话框内图片("对话框-是的我要去");
	end
end

function _大大王()

		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -55, -5);
			点击坐标(50, 480/2)
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-狮陀岭1", -5, 0)
			点击坐标(25, 480/2 - 50)
		end

		if(当前城市("狮坨岭")) then
			点击小地图("小地图-大大王");  --点的是小地图位置
			点击坐标(510, 94);
		end

		if(当前城市("狮王洞")) then
			跑镖结束给予("跑镖-大大王")
		end


end



function _二大王()
出领取跑镖门()
		找驿站老板()
		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -55, 0);
			点击坐标(50, 480/2);
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-狮陀岭1", -5, 0)
			点击坐标(50, 480/2)
			--点击图片("传送门", 3)
		end

		if(当前城市("狮坨岭")) then
			点击小地图("小地图-二大王");  --点的是小地图位置
			点击坐标(640/2, 100)
		end

		跑镖结束给予("跑镖-二大王")

	end
	

--从接跑镖任务进门开始
function 日常1()
	关闭无关窗口()
	--点击坐标(500, 240);
	--点击图片("跑镖任务领取人", 5); --匹配程度不要太精确
	--点击图片("二级镖银");
	--点击对话框内图片("跑镖-7500现金");
	if(存在图片("程咬金")) then
		出领取跑镖门()
		点击小地图("大唐官府")

		
		--进入到程咬金的屋子里后
		点击坐标(145,150)
		点击坐标(168,150)
		跑镖结束给予()
	elseif(存在任务("日常-跑镖-大大王2")) then
		_大大王()
		
	elseif(存在任务("日常-跑镖-大大王")) then

		_大大王()

	elseif(存在任务("日常-跑镖-牛魔王")) then

		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			点击小地图("地图-大唐境外");
			点击左上角();
		end
		
		点击小地图("魔王寨")
		点击左上角();
		点击小地图("地图-魔王寨");
		点击右上角();
		
		跑镖结束给予()
		
	elseif(存在任务("日常-跑镖-晶晶姑娘")) then

		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			点击小地图("地图-大唐境外");
			移动直到遇到("左", "传送门", 5);  --进传送门, 匹配程度不要太高
		end
		点击小地图("地图-盘丝岭")
		传送();  --进传送门
		点击小地图("地图-盘丝岭-屋子");
		点击左上角();
		点击图片("晶晶姑娘");
		跑镖结束给予()

	
	elseif(存在任务("日常-跑镖-三大王")) then
		出领取跑镖门()
		找驿站老板()
		点击小地图("地图-大唐境外");
		点击坐标(100, 480/2);
		点击小地图("小地图-狮坨岭");
		点击左上角();
		点击小地图("跑镖-小地图-三大王");
		点击坐标(419, 208);  --走到npc附近
		跑镖结束给予()

	elseif(存在任务("日常-跑镖-二大王1")) then

		_二大王()
				
	elseif(存在任务("日常-跑镖-二大王")) then

		_二大王()

	elseif(存在任务("日常-跑镖-春十三娘")) then

		出领取跑镖门()
		找驿站老板()

		if 当前城市("大唐国境") then
			点击小地图("小地图-大唐境外2", -55, 0);
			点击坐标(100, 480/2);
		end
		
		if 当前城市("大唐境外") then
				点击小地图("小地图-盘丝岭1")
				点击坐标(640 / 2, 50)
		end

		if 当前城市("盘丝岭") then
			点击小地图("小地图-盘丝岭-屋子");
			点击坐标(510, 94);
		end
		
		if 当前城市("盘丝洞") then
			点击坐标(640/2, 480/2)
			隐藏玩家()
			跑镖结束给予("跑镖-春十三娘");
		end

	elseif(存在任务("日常-跑镖-李靖")) then
		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -55, 0);
			点击坐标(50, 480/2);  --传送门
			点击坐标(50, 480/2);  --传送门
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-长寿郊外");
			点击坐标(100, 480/2);
			隐藏玩家()
			走到旁边("跑镖-传送长寿郊外NPC")
			点击图片("跑镖-传送长寿郊外NPC")
			点击对话框内图片("对话框-是的我要去")
		end

		if(当前城市("长寿郊外")) then
			点击小地图("小地图-天宫")
			隐藏玩家()
			点击图片("跑镖-天将")
			点击对话框内图片("对话框-是的我要去")
		end

		
		if(当前城市("天宫")) then
			点击小地图("小地图-天宫-屋子")
			点击坐标(200, 200)  --进传送门
		end

		if(当前城市("凌霄宝殿")) then
			点击坐标(50, 480 /2)
			点击坐标(50, 480 /2)
			点击坐标(50, 480 /2)
			点击坐标(50, 480 /2) --靠近李靖
		end

		跑镖结束给予("跑镖-李靖")
	elseif(存在任务("日常-跑镖-杨戬")) then	
		出领取跑镖门()
		找驿站老板()

		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -55, 0);
			点击坐标(50, 480/2);  --传送门
			点击坐标(50, 480/2);  --传送门
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-长寿郊外");
			点击坐标(100, 480/2);
			隐藏玩家()
			走到旁边("跑镖-传送长寿郊外NPC")
			点击图片("跑镖-传送长寿郊外NPC")
			点击对话框内图片("对话框-是的我要去")
		end

		if(当前城市("长寿郊外")) then
			点击小地图("小地图-天宫")
			隐藏玩家()
			点击图片("跑镖-天将")
			点击对话框内图片("对话框-是的我要去")
		end

		
		if(当前城市("天宫")) then
			点击小地图("小地图-天宫-屋子")
			点击坐标(121, 121)  --进传送门
		end

		if(当前城市("凌霄宝殿")) then
			点击坐标(50, 480 /2)
		end

		跑镖结束给予("跑镖-杨戬")
		
	elseif(存在任务("日常-跑镖-秦琼")) then
		出领取跑镖门()

		if 当前城市("长安城") then 
			点击小地图("小地图-秦琼");
			if 当前城市("长安城") then 点击坐标(200, 200) end
			if 当前城市("长安城") then 点击坐标(200, 200) end
			if 当前城市("长安城") then 点击坐标(200, 200) end
		end
		
		if 当前城市("秦琼府") then
			点击坐标(100, 100)
			跑镖结束给予("跑镖-秦琼")
		end

		
		跑镖结束给予()
		
	elseif(存在任务("日常-跑镖-菩提祖师1")) then
		出领取跑镖门()
		找驿站老板()
		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -55, 0);
			点击坐标(50, 480/2)
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-长寿郊外");
			点击坐标(100, 480/2);
			隐藏玩家()
			走到旁边("跑镖-传送长寿郊外NPC")
			点击图片("跑镖-传送长寿郊外NPC")
			点击对话框内图片("对话框-是的我要去")
		end		

		
		if(当前城市("长寿郊外")) then
			点击小地图("小地图-长寿村", 50, 0)
			点击坐标(640/2, 30)
		end		

		if(当前城市("长寿村")) then
			点击小地图("小地图-方寸山", 50, 0)
			点击坐标(640/2, 30)
		end		
	
		if(当前城市("方寸山")) then
			点击小地图("跑镖-菩提祖师-屋子")
			点击坐标(500, 100)
		end		

		if(当前城市("灵台宫")) then
			点击坐标(499, 88)
			点击坐标(499, 88)
			跑镖结束给予("跑镖-菩提祖师")
		end		
				
	elseif(存在任务("日常-跑镖-空度禅师1")) then
		
		出领取跑镖门()

		if 当前城市("长安城") then
			点击小地图("小地图-化生寺")
			点击坐标(510, 94)  --传送门
		end

		if(当前城市("化生寺")) then 
			点击小地图("跑镖-化生寺-屋子")
			点击坐标(440, 150)  --传送门
		end

		if 当前城市("藏经阁") then
			隐藏玩家()
			跑镖结束给予("跑镖-空度禅师")
		end
			
	elseif(存在任务("日常-跑镖-空度禅师")) then
		出领取跑镖门()

	elseif(存在任务("日常-跑镖-地藏王")) then
		出领取跑镖门()
		找驿站老板()
		
		if(当前城市("大唐国境")) then
			点击小地图("小地图-地府", -10, 0)
			点击坐标(100, 100)  --传送门
		end

		if 当前城市("地府") then 
			点击小地图("小地图-地府-屋子")
			点击坐标(100, 100)
        end

		if 当前城市("森罗殿") then
			if 当前城市("森罗殿") then 点击坐标(240, 10) end
			if 当前城市("森罗殿") then 点击坐标(240, 10) end
			if 当前城市("森罗殿") then 点击坐标(240, 10) end
		end

		if 当前城市("地藏王府") then
			跑镖结束给予("跑镖-地藏王")
		end

        
	elseif(存在任务("日常-跑镖-孙婆婆")) then
		出领取跑镖门();
		if(当前城市("长安城")) then 
			点击小地图("小地图-江南野外")
			点击坐标(530, 399)
		end

		if(当前城市("江南野外")) then
			点击小地图("小地图-建邺城3")
			点击坐标(620, 100);
		end

		if(当前城市("建邺城")) then
			点击小地图("小地图-东海湾1")
			点击坐标(620, 480 /2 + 100);
		end

		if(当前城市("东海湾")) then
			点击小地图("小地图-傲来国")
			隐藏玩家()
		if(存在图片("驿站老板", 5)) then 点击图片("驿站老板", 5) end
		if(存在图片("驿站老板1", 5)) then  点击图片("驿站老板1", 5)  end
		if(存在图片("跑镖-驿站老板2", 5)) then  点击图片("跑镖-驿站老板2", 5)  end
			点击对话框内图片("对话框-是的我要去", 5)
		end

		if(当前城市("傲来国")) then
			点击小地图("小地图-女儿村2")
			点击坐标(100, 100)
		
		end
		
		if(当前城市("女儿村村长家")) then   --这个顺序
			跑镖结束给予("跑镖-孙婆婆")
		end
		
		if(当前城市("女儿村")) then
			点击小地图("小地图-女儿村-屋子")
			点击坐标(100, 480/2)
		end


	elseif(存在任务("日常-跑镖-镇元大仙")) then
		出领取跑镖门()

		if(当前城市("长安城")) then
			找驿站老板()
		end

		if(当前城市("大唐国境")) then
			点击小地图("小地图-大唐境外2", -50, 0)
			点击坐标(100, 100)
		end

		if(当前城市("大唐境外")) then
			点击小地图("小地图-五庄观")
			点击坐标(510, 94);
			点击坐标(510, 94);
		end

		if(当前城市("五庄观")) then
			点击小地图("小地图-镇元大仙-屋子")
			点击坐标(510, 94);
		end

		if(当前城市("乾坤殿")) then
			点击坐标(510, 94);
			跑镖结束给予("跑镖-镇元大仙", 3)
		end

	elseif(存在任务("日常-跑镖-东海龙王")) then
		出领取跑镖门()
		
		if(当前城市("长安城")) then
			点击小地图("小地图-江南野外1", 50, 5)
			点击坐标(600, 420)
		end

		if(当前城市("江南野外")) then
			点击小地图("小地图-建邺城3")
			点击坐标(620, 100);
		end
		
		if(当前城市("建邺城")) then
			点击小地图("小地图-东海湾", 20, 0)
			点击坐标(620, 100);
		end
			
		if(当前城市("东海湾")) then
			点击小地图("小地图-龙宫", 0, -40)
			隐藏玩家()
			点击图片("跑镖-东海老虾传送")
			点击对话框内图片("对话框-是的我要去")
		end
				
		if(当前城市("龙宫")) then
			点击小地图("跑镖-龙宫-屋子")
			点击坐标(437, 148)
		end	
				
		if(当前城市("水晶宫")) then
			点击坐标(640 /2  + 100, 480/2)  --靠近龙王
			点击坐标(640 /2  + 100, 480/2)  --靠近龙王
				
			跑镖结束给予("跑镖-东海龙王")
		end	

		
	else
		结束脚本("没有写的跑镖");
	end

	--装备物品("红色合成旗");    --旗子, 回去
	--点击小地图("小地图-酒");
	--点击小地图("小地图-镖");
	--点击右上角();   --进门
	--点击右中();
end